music_hackathon/app/controllers/artists_controller.rb

  def new
     @artists = Artist.all
---
SELECT "artists".* FROM "artists"

  def create
     @artists = Artist.all

    @artist = Artist.new(params.require(:artist).permit(:name))

    if @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Bob Marley"], ["created_at", "2016-07-16 08:41:02.859692"], ["updated_at", "2016-07-16 08:41:02.859692"]]